Repository: lowtone/lowtone-woocommerce-ordernumbers
Catalog: assets/languages/lowtone_woocommerce_ordernumbers-*.po
Languages: nl_nl

source: Order numbers
nl_nl: Ordernummers

source: Provide a template for formatting new order numbers. Tags can be used to add dynamic values to the order number. A tag consists of a key surrounded by percent signs like %year%. The key refers to a value that will replace the tag, the previous example for instance would add the year in which the order was placed to the order number. Below is a list of available tags (additional tags could be added by plugins).
nl_nl: Geef een sjabloon op voor de opmaak van de ordernummers. Hierbij kan gebruik gemaakt worden van tags om dynamische waarden aan het ordernummer toe te voegen. Een tag bestaat uit een sleutel ingesloten door procent-tekens, bijvoorbeeld %year%. De sleutelwaarde refereert naar een waarde waardoor de tag vervangen zal worden, in het vorige voorbeeld zal bijvoorbeeld het jaar waarin de bestelling geplaatst is aan het ordernummer toegevoegd worden. Hieronder vind je een lijst van beschikbare tags (meer tags kunnen door plugins toegevoegd worden).

source: Key
nl_nl: Sleutel

source: Value
nl_nl: Waarde

source: The year in which the order was placed.
nl_nl: Het jaar waarin de bestelling is geplaatst.

source: The numeric representation for the month in which the order was placed.
nl_nl: De numerieke waarde voor de maand waarin de bestelling is geplaatst.

source: The day of the month in which the order was placed.
nl_nl: De dag van de maand waarin de bestelling is geplaatst.

source: The ISO-8601 week number for the year in which the order was placed.
nl_nl: Een ISO-8601 weeknummer voor het jaar waarin de bestelling is geplaatst.

source: The ID of the order.
nl_nl: Het ID nummer van de bestelling.

source: The total number of orders placed.
nl_nl: Het totaal aantal bestellingen dat geplaatst is.

source: The number of orders placed in the year in which the order was placed.
nl_nl: Het aantal bestellingen dat geplaatst is in het jaar waarin de bestelling is geplaatst.

source: The number of orders placed in the month in which the order was placed.
nl_nl: Het aantal bestellingen dat geplaatst is in de maand waarin de order is geplaatst.

source: The number of orders placed on the day on which the order was placed.
nl_nl: Het aantal bestellingen dat is geplaatst op de dag waarop de bestelling is geplaatst

source: The total number of orders placed by the user who placed the order.
nl_nl: Het totaal aantal bestellingen dat door de gebruiker die de bestelling plaatst geplaatst is.

source: Modifiers can be added behind the key to convert the value to a default format. Modifiers are separated from the key and each other by a colon. Currenty two modifiers are available, namely (in this order):
nl_nl: Modifiers kunnen achter de sleutel toegevoegd worden om de waarde om te zetten naar een standaard formaat. Modifiers zijn van elkaar en van de sleutel gescheiden door middel van een dubbele punt. Er zijn op dit moment twee modifiers beschikbaar, dit zijn (in deze volgorde):

source: <strong>Padding</strong> &mdash; Padding could be used to extend the value to a default length. For instance when using the order_count value padding could be used to create an four-digit number even for the lower numbers by adding some zeros to the left of the number (e.g. "1" becomes "0001"). Padding is defined by two values separated by a comma, the first value being the desired length, the optional second value the character used for the padding which defaults to "0". When the given length is less then the length of the value characters will be removed from the left side of the value until it matches the required length.
nl_nl: <strong>Padding</strong> &mdash; Padding kan gebruikt worden om een waarde een vaste lengte te geven. Wanneer bijvoorbeeld van de order_count waarde gebruik gemaakt wordt kan er van padding gebruik gemaakt worden om, ook voor lagere aantallen, een viercijferig getal te krijgen door nullen aan de linkerkant van het cijfer toe te voegen ("1" wordt zo bijvoorbeeld "0001"). Padding wordt gedefinieerd door twee waarden die van elkaar gescheiden zijn met een komma, de eerste van deze waarden is de gewenste lengte, de optionele tweede waarde is het teken dat gebruikt wordt om de waarde aan te vullen. Standaard is dit "0". Wanneer de gewenste lengte korter is dan de lengte van de betreffende waarde zullen er tekens aan de linkerkant afgehaald worden totdat de waarde de gewenste lengte heeft.

source: <strong>Split</strong> &mdash; The second modifier could be used to make the order number more readable. Like the padding it consists of two values separated by a comma, the first being the size for each part and the second optional value being a character used to glue the parts together which defaults to "-".
nl_nl: <strong>Splitsen</strong> &mdash; De tweede modifier waar gebruik van gemaakt kan worden is bedoeld om het ordernummer beter leesbaar te maken. Net als bij padding bestaat deze uit twee waarden, van elkaar gescheiden met een komma, waarvan de eerste waarde de lengte aangeeft voor de stukken waarin de waarde opgesplitst wordt en de tweede, optionele waarde een teken definieert waarmee de stukken aan elkaar geplakt worden. Standaard is dit "-".

source: Order number format
nl_nl: Ordernummer opmaak

source: A template used for creating new order numbers.
nl_nl: Een sjabloon voor het opmaken van nieuwe ordernummers.
